---
kind: method
id: M:Autodesk.Revit.DB.DoubleArray.GetEnumerator
source: html/95cd4850-14f7-5d60-aecb-eb28a45f94a4.htm
---
# Autodesk.Revit.DB.DoubleArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.